tasks/week-1/test-results-simal/low_load_kubernetes.txt
(base) simalguven@Simals-MacBook-Air-370 myapp % ab -n 100 -c 10 http://localhost:30007/
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            30007

Document Path:          /
Document Length:        31 bytes

Concurrency Level:      10
Time taken for tests:   0.047 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      13200 bytes
HTML transferred:       3100 bytes
Requests per second:    2125.94 [#/sec] (mean)
Time per request:       4.704 [ms] (mean)
Time per request:       0.470 [ms] (mean, across all concurrent requests)
Transfer rate:          274.05 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       1
Processing:     1    4   2.6      3      12
Waiting:        1    3   2.2      3      11
Total:          1    4   2.7      3      12

Percentage of the requests served within a certain time (ms)
  50%      3
  66%      4
  75%      6
  80%      6
  90%      9
  95%      9
  98%     12
  99%     12
 100%     12 (longest request)