tasks/week-1/test-results-simal/medium_load_kubernetes.txt
(base) simalguven@Simals-MacBook-Air-370 myapp % ab -n 500 -c 20 http://localhost:30007/ 
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        
Server Hostname:        localhost
Server Port:            30007

Document Path:          /
Document Length:        31 bytes

Concurrency Level:      20
Time taken for tests:   0.132 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      66000 bytes
HTML transferred:       15500 bytes
Requests per second:    3778.58 [#/sec] (mean)
Time per request:       5.293 [ms] (mean)
Time per request:       0.265 [ms] (mean, across all concurrent requests)
Transfer rate:          487.08 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       2
Processing:     1    4   2.0      4      13
Waiting:        1    3   1.9      3      13
Total:          1    5   2.1      4      15

Percentage of the requests served within a certain time (ms)
  50%      4
  66%      5
  75%      5
  80%      6
  90%      8
  95%      9
  98%     11
  99%     13
 100%     15 (longest request)